<script setup lang="ts">
import GuideCard from "~/components/GuideCard.vue";
import SeparateLine from "~/components/SeparateLine.vue";
import type { GuideType } from "~/types/GuideType";

let guides = ref<GuideType[]>([
  {
    firstname: "Александр",
    surname: "Аладинский",
    description: "Экскурсовод (гид), регистрационный №: 41-Э-43078-23",
    text: "Это он ответит вам, когда позвоните. Рулил автомобильным бизнесом, пока однажды на вершине Эльбруса не понял, что дело жизни выглядит совсем иначе. С тех пор прошёл вершины Кавказа, вулканы Камчатки, тысячники, перебрался на Марс, исследовал его и вернулся на Землю.",
    image: "@/assets/images/AlexandrGuide.jpg",
  },
  {
    firstname: "Марина",
    surname: "Аладинская",
    description: "Экскурсовод (гид), регистрационный №: 41-Э-43072-23",
    text: "Это он ответит вам, когда позвоните. Рулил автомобильным бизнесом, пока однажды на вершине Эльбруса не понял, что дело жизни выглядит совсем иначе. С тех пор прошёл вершины Кавказа, вулканы Камчатки, тысячники, перебрался на Марс, исследовал его и вернулся на Землю.",
    image: "@/assets/images/unknownGuide.jpg",
  },
]);

let reasons = ref<{title: string, text: string}[]>([
{
  title: 'Аборигены Камчатки',
  text: 'Мы родились на Камчатке, прожили здесь всю жизнь и искренне любим свой край. Много путешествовали по полуострову и готовы показать Вам жемчужины Камчатки. Нам есть, что Вам показать!'
},
{
  title: 'Всезнайки',
  text: 'Мы аттестованные гиды-экскурсоводы, проводим экскурсии по Камчатке. Постоянно расширяем свои знания на курсах по туризму, конференциях, лекциях. Нам есть, что Вам рассказать!'
},
{
  title: 'Экономия',
  text: 'Вы напрямую без посредников обращаетесь к нам и экономите на комиссии туроператору.'
},
{
  title: 'Столько не живут, сколько мы тут работаем!',
  text: 'Мы давно работаем в сфере туризма, наш опыт и профессионализм позволяет нам работать с людьми разного возраста и физической подготовки.'
},
{
  title: 'Аккуратисты',
  text: 'Мы следим за чистотой и комфортом автомобилей, перед каждой экскурсией проводим уборку в машинах, сами опрятны и аккуратны.'
},
{
  title: 'Удобно!',
  text: 'Мы можем с Вами работать как Вам удобно - по договору или без. Оплата может производиться наличными или переводом по карте.'
},
{
  title: 'Можем и просто поговорить!',
  text: 'Вы можете обратиться к нам за консультацией, советом в организации отдыха по Камчатке. Поможем, чем можем!'
}
])
</script>

<template>
  <section class="about-us section">
    <div class="main-container max-width">
      <div class="about-us__header">
        <SeparateLine />
        <span class="title"
          >Сайт гидов и экскурсоводов Александра и Марины Аладинских</span
        >
      </div>
      <div class="about-us__cards">
        <GuideCard
          v-for="(guide, index) in guides"
          :key="index"
          :firstname="guide.firstname"
          :surname="guide.surname"
          :description="guide.description"
          :text="guide.text"
          :image="guide.image"
        />
      </div>
      <div class="about-us__why-we">
        <div class="about-us__why-we__title">
          <span class="title">Дорогие друзья!</span>
        </div>
        <div class="about-us__why-we__text">
          <p class="about-us-text">
          Рады приветствовать Вас на нашем сайте!
            Нас зовут <span class="demibold">Александр и Марина Аладинские</span>.
            Назовем 7 причин, почему Вам стоит обратиться за экскурсией к нам.
          </p>

          <ul>
            <li
            v-for="(reason, index) in reasons" :key="index">
              <div><span class="demibold">{{ reason.title }}</span></div>
              <div><span>{{ reason.text }}</span></div>
            </li>
          </ul>

          <p>
            Индивидуальный подход к каждому гостю - наша визитная карточка. Мы
            создаем незабываемые путешествия, учитывая интересы и пожелания
            каждого клиента. Присоединяйтесь к нам, и мы подарим вам настоящее
            погружение в мир камчатской природы! С нами ваши экскурсии
            превратятся в захватывающее путешествие с элементами личного
            открытия. Душевность, профессионализм и страсть к родному краю - вот
            что делает наши туры особенными!" Этот текст подчеркивает уникальные
            преимущества вашей компании через акцент на местных гидах, глубоких
            знаниях и персональном подходе.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped lang="scss">
@use "./assets/css/aboutUs.scss" as *;
</style>
